%% Revision note

%% 20170607:  Version 1.0.0
%  สร้างด้วยรูปแบบ Command Window / Text Mode 
%
% 

%% 20170627: Version 2.0.0
%  สร้างด้วยระบบ Graphic User Interface
%  รูปแบบองค์ประกอบออกแบบโดยนักศึกษา
% 

%% 20170627: Version 2.1.0
%  ปรับปรุงรูปลักษณ์ใหม่ ให้กราฟ Roughness กว้าง-สูง มากขึ้น
%  ลดขนาดกราฟ VSI และ รูปภาพแสดงความเป็นไปขณะคำนวณ
%  แก้ไขระบบให้เกิดความถูกต้องในการคำนวณ
%
% 

%% 20170707: Version 2.1.12
%  อีกครั้ง-แก้ไขระบบให้เกิดความถูกต้องในการคำนวณ
%  เพิ่มระบบนำภาพออกไปยังหน้าต่างใหม่
%
% 
%% 20170707: Version 2.1.13
%  - เพิ่มการบันทึก imFamily ไปยัง image_family.mat ก่อนเรียก vsi_row
%  - แก้ไข เมื่อคำนวณ VSI ทั้งแถวแล้ว ผิดพลาด Value startID not found.
%  เนื่องจากมีการ save ตัวแปรนี้แล้วผิดชื่อ
%
% 